import React from 'react';
import styles from './Header.module.css'

const Header = ({title}) => {

    return (
        <div className={styles.header}>
            <div className={styles.text}>
                {!title ? 'Ловушка предложений' : title}
            </div>
            <div className={styles.logoContainer}>
                <div className={styles.logo}>
                    <svg width="114" height="36" viewBox="0 0 114 36" fill="none"
                         xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                              d="M35.7313 0.00137329H0V36.0005H35.7313V0.00137329ZM31.1937 21.3146C31.1937 26.4267 25.2139 30.5709 17.8373 30.5709C10.9046 30.5709 5.20557 26.9104 4.54488 22.2261C4.47437 21.7262 4.88808 21.3146 5.39031 21.3146H6.88993C7.39216 21.3146 7.78873 21.7306 7.91569 22.2191C8.65394 25.0597 12.8149 27.2353 17.8373 27.2353C23.3812 27.2353 27.8754 24.5845 27.8754 21.3146V9.6786C27.8754 9.17367 27.4682 8.76434 26.966 8.76434H15.5113C15.0091 8.76434 14.6019 8.35501 14.6019 7.85007V6.34298C14.6019 5.83805 15.0091 5.42872 15.5113 5.42872H30.2843C30.7866 5.42872 31.1937 5.83805 31.1937 6.34298V21.3146Z"
                              fill="url(#paint0_linear)"/>
                        <path fill-rule="evenodd" clip-rule="evenodd"
                              d="M74.867 0.000915527H39.1357V36H74.867V0.000915527ZM66.1857 18C66.1857 23.1125 62.072 27.2569 56.9976 27.2569C51.9232 27.2569 47.8096 23.1125 47.8096 18C47.8096 12.8876 51.9232 8.7431 56.9976 8.7431C62.072 8.7431 66.1857 12.8876 66.1857 18ZM69.4752 18C69.4752 24.9428 63.8888 30.5711 56.9976 30.5711C50.1064 30.5711 44.52 24.9428 44.52 18C44.52 11.0572 50.1064 5.4289 56.9976 5.4289C63.8888 5.4289 69.4752 11.0572 69.4752 18Z"
                              fill="url(#paint1_linear)"/>
                        <path fill-rule="evenodd" clip-rule="evenodd"
                              d="M114 0H78.2688V35.9991H114V0ZM93.107 18.7041C93.4939 18.3141 93.4939 17.6851 93.1069 17.2952L84.3553 8.47798C83.9682 8.08807 83.9682 7.45896 84.3553 7.06905L85.2728 6.1446C85.664 5.75054 86.3012 5.75055 86.6923 6.1446L95.4225 14.9402C95.8137 15.3343 96.451 15.3343 96.8421 14.9402L105.573 6.14246C105.964 5.74831 106.601 5.74831 106.992 6.14246L107.91 7.06701C108.297 7.4569 108.297 8.08589 107.91 8.47579L99.158 17.2949C98.771 17.6848 98.771 18.3139 99.158 18.7037L107.912 27.5233C108.299 27.9132 108.299 28.5423 107.912 28.9322L106.994 29.8567C106.603 30.2508 105.966 30.2508 105.575 29.8567L96.8424 21.0587C96.4512 20.6646 95.8139 20.6647 95.4228 21.0588L86.6922 29.8567C86.301 30.2509 85.6637 30.2509 85.2725 29.8567L84.355 28.9322C83.9681 28.5423 83.9681 27.9133 84.355 27.5234L93.107 18.7041Z"
                              fill="url(#paint2_linear)"/>
                        <defs>
                            <linearGradient id="paint0_linear" x1="25.3159" y1="-0.9" x2="17.9311" y2="36.0135"
                                            gradientUnits="userSpaceOnUse">
                                <stop stop-color="#0093D0"/>
                                <stop offset="1" stop-color="#002573"/>
                            </linearGradient>
                            <linearGradient id="paint1_linear" x1="50.6317" y1="9.05726e-06" x2="74.8974"
                                            y2="33.406"
                                            gradientUnits="userSpaceOnUse">
                                <stop stop-color="#0093D0"/>
                                <stop offset="1" stop-color="#002573"/>
                            </linearGradient>
                            <linearGradient id="paint2_linear" x1="103.585" y1="-0.901374" x2="79.7224" y2="37.4484"
                                            gradientUnits="userSpaceOnUse">
                                <stop stop-color="#0093D0"/>
                                <stop offset="1" stop-color="#002573"/>
                            </linearGradient>
                        </defs>
                    </svg>
                </div>

                <div className={styles.logo}>
                    <img src="logo_rosatom.png" alt=""/>
                </div>
            </div>
        </div>
    );
};

export default Header;